0.org/U
/*----------------------------------------------------------------------------------*\
|                                                                                    | 
|    ANSA_VERSION: 14.0.0                                                            | 
|                                                                                    | 
|    file created by  A N S A  Mon Aug 15 14:28:13 2016                              | 
|                                                                                    | 
|    Output from: D:/work/N304-UAZ-reductor/cae-of/Untitled                          | 
|                                                                                    | 
\*----------------------------------------------------------------------------------*/



FoamFile
{
	version 2.0;
	format ascii;
	class volVectorField;
	object U;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/


dimensions [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{

	"if_body_in_beams1_out|if_body_out_beams2_in|if_body_out_beams1_in|if_body_in_beams2_out"
	{
	  type            uniformFixedValue;
	  uniformValue    (0 0 0);
// 	  type		zeroGradient;
	}
	
	"if_body_wheel|if_wheel_body"
	{
		type            cyclicAMI;
		value           $internalField;
	}
	
	wheel-wall
	{
// 	    type          rotatingWallVelocity;
// 	    origin        (0 -0.67884 -0.032848);
// 	    axis          (0 -0.80484 -0.032848);
// 	    omega         -0.837758;
	  type            uniformFixedValue;
	  uniformValue    (0 0 0);
// 	  type		zeroGradient;
	}
	
	body-wall
	{
// 	    type          rotatingWallVelocity;
// 	    origin        (0 -0.67884 -0.032848);
// 	    axis          (0 -0.80484 -0.032848);
// 	    omega         -0.837758;
	  type            uniformFixedValue;
	  uniformValue    (0 0 0);
// 	  type		zeroGradient;
	}
	
	beam1-wall
	{
// 	    type          rotatingWallVelocity;
// 	    origin        (0.24889 -0.75284 -0.015444);
// 	    axis          (0.012918 -0.75284 -0.031945);
// 	    omega         83.7758;
	  type            uniformFixedValue;
	  uniformValue    (0 0 0);
// 	  type		zeroGradient;
	}

	beam2-wall
	{
// 	    type          rotatingWallVelocity;
// 	    origin        (0.24889 -0.75284 -0.015444);
// 	    axis          (0.012918 -0.75284 -0.031945);
// 	    omega         83.7758;
	  type            uniformFixedValue;
	  uniformValue    (0 0 0);
// 	  type		zeroGradient;
	}

}
