system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interDyMFoam;

startFrom       latestTime//startTime;

startTime       0;

stopAt          endTime;

endTime         5.0;

deltaT          1e-3;//5e-8;//1e-8;//1e-6;//1e-6;

writeControl    adjustableRunTime;

writeInterval   1e-3;//1e-4;//1e-6;//0.025;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;//0.7;//60;//0.9;//1.5;

maxAlphaCo      1;

maxDeltaT       1e-6;//0.00005;//0.005;

// ************************************************************************* //
