system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  //forDel
    Phi
    {
        solver          GAMG;
        smoother        DIC;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;

        tolerance       1e-06;
        relTol          0.01;
    }
    //
    "alpha.water.*"
    {
        nAlphaCorr          1;
        nAlphaSubCycles     2;
        cAlpha              1;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.02;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        nPreSweeps      0;
        nPostSweeps     2;
        mergeLevels     1;
    }

    "pcorr.*"
    {
        $p_rgh;
        tolerance       0.1;
        relTol          0;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    ".*(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    "(U|T|k|epsilon).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        nSweeps         1;
    }
}
// forDel
potentialFlow
{
    nNonOrthogonalCorrectors 3;
    PhiRefCell 0;
    PhiRefValue 0;
}
//

PIMPLE
{
    momentumPredictor   yes;
    correctPhi          yes;
    transSonic          no;
    nOuterCorrectors    2;
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;

}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        "U.*"           0.7;//1;
        "k.*"           0.7;//1;
        "epsilon.*"     0.7;//1;
        "T.*"           0.7;//1;
    }


}


// ************************************************************************* //
